---
kind: other
id: Properties.T:Autodesk.Revit.DB.DoubleArrayIterator
source: html/80832043-be2e-929f-cc60-c4751bdf9caf.htm
---
# DoubleArrayIterator Properties

Retrieves the item that is the current focus of the iterator.